avnet-iotconnect/iotc-stm32-n6-demos/Projects/x-cube-n6-ai-multi-pose-estimation-v1.0.0/Src/app.c
static void nn_thread_fct(ULONG arg)
{
  const LL_Buffer_InfoTypeDef *nn_out_info = LL_ATON_Output_Buffers_Info_Default();
  const LL_Buffer_InfoTypeDef *nn_in_info = LL_ATON_Input_Buffers_Info_Default();
  uint32_t nn_period_ms;
  uint32_t nn_period[2];
  uint8_t *nn_pipe_dst;
  uint32_t nn_out_len;
  uint32_t nn_in_len;
  uint32_t inf_ms;
  uint32_t ts;
  int ret;

  /* setup buffers size */
  nn_in_len = LL_Buffer_len(&nn_in_info[0]);
  nn_out_len = LL_Buffer_len(&nn_out_info[0]);
  //printf("nn_out_len = %d\n", nn_out_len);
  assert(nn_out_len == NN_BUFFER_OUT_SIZE);

  /*** App Loop ***************************************************************/
  nn_period[1] = HAL_GetTick();

  nn_pipe_dst = bqueue_get_free(&nn_input_queue, 0);
  assert(nn_pipe_dst);
  CAM_NNPipe_Start(nn_pipe_dst, CMW_MODE_CONTINUOUS);
  while (1)
  {
    uint8_t *capture_buffer;
    uint8_t *output_buffer;

    nn_period[0] = nn_period[1];
    nn_period[1] = HAL_GetTick();
    nn_period_ms = nn_period[1] - nn_period[0];

    capture_buffer = bqueue_get_ready(&nn_input_queue);
    assert(capture_buffer);
    output_buffer = bqueue_get_free(&nn_output_queue, 1);
    assert(output_buffer);

    /* run ATON inference */
    ts = HAL_GetTick();
     /* Note that we don't need to clean/invalidate those input buffers since they are only access in hardware */
    ret = LL_ATON_Set_User_Input_Buffer_Default(0, capture_buffer, nn_in_len);
    assert(ret == LL_ATON_User_IO_NOERROR);
     /* Invalidate output buffer before Hw access it */
    CACHE_OP(SCB_InvalidateDCache_by_Addr(output_buffer, nn_out_len));
    ret = LL_ATON_Set_User_Output_Buffer_Default(0, output_buffer, nn_out_len);
    assert(ret == LL_ATON_User_IO_NOERROR);
    LL_ATON_RT_Main(&NN_Instance_Default);
    inf_ms = HAL_GetTick() - ts;

    /* release buffers */
    bqueue_put_free(&nn_input_queue);
    bqueue_put_ready(&nn_output_queue);

    /* update display stats */
    tx_mutex_get(&disp.lock, TX_WAIT_FOREVER);
    disp.info.inf_ms = inf_ms;
    disp.info.nn_period_ms = nn_period_ms;
    tx_mutex_put(&disp.lock);
  }
}
//IOTC start
int32_t iot_num_detections = 0;         // # of detected objects
float32_t iot_bbox_x_center = 0.0f;     // x_center of the first detection
float32_t iot_bbox_y_center = 0.0f;     // y_center of the first detection
float32_t iot_bbox_width = 0.0f;        // bounding-box width of the first detection
float32_t iot_bbox_height = 0.0f;       // bounding-box height of the first detection
int32_t iot_class_index = 0;            // class index of the first detection
uint32_t iot_inference_time = 0;        // inference time (ms)
uint32_t iot_postprocess_time = 0;      // post-processing time (ms)
//IOTC end

/*Number of people detected: info.nb_detect
Bounding boxes: info.detects[i].x_center / y_center / width / height
Per-person keypoints: info.detects[i].pKeyPoints[] (each keypoint’s x, y, conf)
Inference and post-process times: info.inf_ms, info.pp_ms
CPU load: from cpu_load via cpuload_get_info()
*/
static void pp_thread_fct(ULONG arg)
{
#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UF
  yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UF || POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_POSE_YOLO_V8_UF
  yolov8_pose_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  mpe_yolov8_pp_static_param_t pp_params;
#else
    #error "PostProcessing type not supported"
#endif
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  mpe_pp_out_t pp_output;
#else
  postprocess_out_t pp_output;
#endif
  uint32_t nn_pp[2];
  void *pp_input;
  int ret;
  int i;

  /* setup post process */
  app_postprocess_init(&pp_params);
  while (1)
  {
    uint8_t *output_buffer;

    output_buffer = bqueue_get_ready(&nn_output_queue);
    assert(output_buffer);
    pp_input = (void *) output_buffer;
    pp_output.pOutBuff = NULL;

    nn_pp[0] = HAL_GetTick();
    ret = app_postprocess_run((void * []){pp_input}, 1, &pp_output, &pp_params);
    assert(ret == 0);
    nn_pp[1] = HAL_GetTick();

    /* update display stats and detection info */
    tx_mutex_get(&disp.lock, TX_WAIT_FOREVER);
    disp.info.nb_detect = pp_output.nb_detect;
    for (i = 0; i < pp_output.nb_detect; i++)
    {
	/*printf("Detect[%d]: x=%.2f y=%.2f w=%.2f h=%.2f class=%d\n",
    	       i,
    	       (double)pp_output.pOutBuff[i].x_center,
    	       (double)pp_output.pOutBuff[i].y_center,
    	       (double)pp_output.pOutBuff[i].width,
    	       (double)pp_output.pOutBuff[i].height
    	);
*/
      disp.info.detects[i] = pp_output.pOutBuff[i];
    }
    disp.info.pp_ms = nn_pp[1] - nn_pp[0];
    tx_mutex_put(&disp.lock);
//IOTC start
iot_num_detections = pp_output.nb_detect;

// If at least one detection exists, pull bounding-box info from the first detection
if (pp_output.nb_detect > 0)
{
    iot_bbox_x_center = pp_output.pOutBuff[0].x_center;
    iot_bbox_y_center = pp_output.pOutBuff[0].y_center;
    iot_bbox_width    = pp_output.pOutBuff[0].width;
    iot_bbox_height   = pp_output.pOutBuff[0].height;
    iot_class_index   = pp_output.pOutBuff[0].class_index;
}
else
{
    // If nothing detected, just reset them to zero or an invalid index
    iot_bbox_x_center = 0.0f;
    iot_bbox_y_center = 0.0f;
    iot_bbox_width    = 0.0f;
    iot_bbox_height   = 0.0f;
    iot_class_index   = -1;
}

// We can also pull the latest inference time & postprocess time from 'disp.info'
iot_inference_time   = disp.info.inf_ms;
iot_postprocess_time = disp.info.pp_ms;

//IOTC end

    bqueue_put_free(&nn_output_queue);
    tx_semaphore_ceiling_put(&disp.update, 1);
  }
}

static void dp_update_drawing_area()
{
  int ret;

  __disable_irq();
  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);
  __enable_irq();
}

